loket/app/Controllers/UserCrud.php

    public function index(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function store() {
        $userModel = new UserModel();
        $data = [
            'name' => $this->request->getVar('name'),
            'email'  => $this->request->getVar('email'),
        ];
        $userModel->insert($data);
---
INSERT INTO `users` (`name`, `email`) VALUES ('udin', 'udin@gmail.com')

    public function singleUser($id = null){
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1

    public function delete($id = null){
        $userModel = new UserModel();
        $data['user'] = $userModel->where('id', $id)->delete($id);
---
DELETE FROM `users`
WHERE `id` = '3'
AND `id` IN ('3')

    public function print($id = null)
    {
      $userModel = new UserModel();
      $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '3'
 LIMIT 1